In [1]:
import pandas as pd

### Connect Pandas to the database with this URL:

In [2]:
titles = pd.read_csv(r'C:\Users\client\Documents\titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [3]:
cast = pd.read_csv(r'C:\Users\client\Documents\cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Using groupby(), count the number of films that have been released each decade in the history of cinema.

In [4]:
titles.loc[(titles['year']>=1890) & (titles['year']<1900), 'column_name'] = 189
titles.loc[(titles['year']>=1900) & (titles['year']<1910), 'column_name'] = 190
titles.loc[(titles['year']>=1910) & (titles['year']<1920), 'column_name'] = 191
titles.loc[(titles['year']>=1920) & (titles['year']<1930), 'column_name'] = 192
titles.loc[(titles['year']>=1930) & (titles['year']<1940), 'column_name'] = 193
titles.loc[(titles['year']>=1940) & (titles['year']<1950), 'column_name'] = 194
titles.loc[(titles['year']>=1950) & (titles['year']<1960), 'column_name'] = 195
titles.loc[(titles['year']>=1960) & (titles['year']<1970), 'column_name'] = 196
titles.loc[(titles['year']>=1970) & (titles['year']<1980), 'column_name'] = 197
titles.loc[(titles['year']>=1980) & (titles['year']<1990), 'column_name'] = 198
titles.loc[(titles['year']>=1990) & (titles['year']<2000), 'column_name'] = 199
titles.loc[(titles['year']>=2000) & (titles['year']<2010), 'column_name'] = 200
titles.loc[(titles['year']>=2010) & (titles['year']<2020), 'column_name'] = 201
titles.loc[(titles['year']>=2020) & (titles['year']<2030), 'column_name'] = 202

titles.groupby('column_name')['title'].value_counts()

column_name  title
189.0        Miss Jerry                                        1
             Reproduction of the Corbett and Jeffries Fight    1
             The Startled Lover                                1
190.0        Amleto                                            1
             Andreas Hofer                                     1
                                                              ..
202.0        War in Snow                                       1
             Wee and the Wright Brothers                       1
             Wingman                                           1
             Xenomorph                                         1
             Your Choice: Hot or Not                           1
Name: title, Length: 227641, dtype: int64

### Use groupby() count the number of "Hamlet" films made each decade.

In [5]:
titles1=titles[titles['title']=='Hamlet']
titles1.groupby('column_name')['title'].value_counts()

column_name  title
191.0        Hamlet    3
192.0        Hamlet    1
194.0        Hamlet    1
195.0        Hamlet    1
196.0        Hamlet    2
197.0        Hamlet    2
198.0        Hamlet    1
199.0        Hamlet    2
200.0        Hamlet    2
201.0        Hamlet    3
Name: title, dtype: int64

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [6]:
cast1=cast[cast['n']==1]
cast2=cast1[cast1['year']>=1950]
cast3=cast2[cast2['year']<=1959]
cast3.groupby('year')['type'].value_counts()

year  type
1950  actor      626
      actress    281
1951  actor      647
      actress    281
1952  actor      607
      actress    293
1953  actor      652
      actress    301
1954  actor      634
      actress    310
1955  actor      641
      actress    281
1956  actor      643
      actress    305
1957  actor      735
      actress    301
1958  actor      710
      actress    295
1959  actor      721
      actress    317
Name: type, dtype: int64

### In the 1950s decade taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

In [7]:
cast1=cast[((cast['n']==1) | (cast['n']==2) | (cast['n']==3) | (cast['n']==4) | (cast['n']==5) ) & ((cast['year']>=1950) & (cast['year']<=1959))].groupby('type')['n'].value_counts()
cast1

type     n
actor    1.0    6616
         5.0    5611
         4.0    5594
         3.0    5587
         2.0    4564
actress  2.0    4556
         3.0    3148
         1.0    2965
         4.0    2849
         5.0    2544
Name: n, dtype: int64

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

In [19]:
cast1=cast[cast['title'].str.contains('Pink Panther')].groupby('title')['title'].value_counts()
cast1

title                           title
Curse of the Pink Panther       Curse of the Pink Panther          67
Revenge of the Pink Panther     Revenge of the Pink Panther        64
Son of the Pink Panther         Son of the Pink Panther            46
The Pink Panther                The Pink Panther                  111
The Pink Panther 2              The Pink Panther 2                 84
The Pink Panther Strikes Again  The Pink Panther Strikes Again     68
The Return of the Pink Panther  The Return of the Pink Panther     30
Trail of the Pink Panther       Trail of the Pink Panther          41
Name: title, dtype: int64

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

In [20]:
cast1=cast[cast['name']=='Frank Oz'].groupby('year')['title'].value_counts()
cast1[cast1>1]

year  title
1979  The Muppet Movie                        8
1981  The Great Muppet Caper                  6
      An American Werewolf in London          2
1982  The Dark Crystal                        2
1984  The Muppets Take Manhattan              7
1985  Follow That Bird                        3
1992  The Muppet Christmas Carol              7
1996  Muppet Treasure Island                  4
1999  Muppets from Space                      4
      The Adventures of Elmo in Grouchland    3
Name: title, dtype: int64

### List each of the characters that Frank Oz has portrayed at least twice.

In [21]:
cast1=cast[cast['name']=='Frank Oz']['character'].value_counts()
cast1[cast1>1]

Miss Piggy        6
Animal            6
Yoda              6
Sam the Eagle     5
Fozzie Bear       4
Bert              3
Cookie Monster    3
Grover            2
Name: character, dtype: int64